Revit 2026 API

# IFCParameterTemplate Constructor

---

Custom constructor for this element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCParameterTemplate(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
IFCParameterTemplate(
	Document^ document
)
```
```fsharp
new :
        document : Document -> IFCParameterTemplate
```

#### Parameters

document Document
     The document where created template is saved.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace